## plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray
module.complete.data.archive_file.lambda_zip: Reading...
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
module.complete.random_id.this: Refreshing state... [id=OA]
data.http.my_public_ip: Reading...
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=0210091463263af45a9e18c7a7607d8f8a1c2054]
module.complete.data.http.my_public_ip: Reading...
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
module.complete.data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.aws_region.current: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.complete.data.aws_caller_identity.current: Reading...
module.complete.data.aws_availability_zones.available: Reading...
module.complete.data.aws_ami_ids.sfos: Reading...
data.aws_availability_zones.available: Reading...
module.complete.data.aws_region.current: Reading...
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-38-fAHVgY]
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-38-sb21oM]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-38-4bbzhN]
data.aws_availability_zones.available: Read complete after 1s [id=us-west-1]
data.aws_availability_zone.available["us-west-1b"]: Reading...
data.aws_availability_zone.available["us-west-1c"]: Reading...
module.complete.data.aws_availability_zones.available: Read complete after 1s [id=us-west-1]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-38-fAHVgY|643C8100-0193-4F3E-96FE-C11547B3DD1D]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-38-sb21oM|A25702EC-8A8B-4041-9CD9-A909E90F429B]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=2302266310]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.data.template_file.user_data: Reading...
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=356026141]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-38-4bbzhN|05089D91-EE7D-4E1C-B72C-11DFFAB78D87]
module.complete.data.template_file.user_data: Read complete after 0s [id=0a2c21c1c07fb4bae64a2c6540bf49446699fabbc92241c5edb7c6a9a6862256]
module.complete.data.aws_ami_ids.sfos: Read complete after 1s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 0s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 0s [id=ami-0434af33056d1e189]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 0s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.data.aws_caller_identity.current: Read complete after 1s [id=447552758530]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0a04cc55c14c0f594]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-38-447552758530]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-0460c61ad511fcde6]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-006eb3c1a4488210c]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-0037883f0b1840e67]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-0eaaf4953d83b2361]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-02ffccee602918e8c]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01fce749fc809cbbd]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-017eaa2cc025ce155]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-0d296bd1619f56dcd]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-0460c61ad511fcde61080289494]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-01c58e9bddde5d44f]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-0b3bfd622b82cc0de]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-0c47b7a826e3ef6fa]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-01a54684d73b271ec]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-0eaaf4953d83b23611080289494]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-07a4dc2782366f37b]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-38]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 1
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
+       prefix      = "example-complete"
    }

  # module.complete.aws_eip.this[0] will be updated in-place
  ~ resource "aws_eip" "this" {
        id                        = "eipalloc-07a4dc2782366f37b"
      ~ tags                      = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # module.complete.aws_iam_instance_profile.this will be updated in-place
  ~ resource "aws_iam_instance_profile" "this" {
        id          = "ec2-instance-profile-SOPHOS_CNF-38"
        name        = "ec2-instance-profile-SOPHOS_CNF-38"
      ~ tags        = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "ec2-iam-role-SOPHOS_CNF-38-447552758530"
        name                  = "ec2-iam-role-SOPHOS_CNF-38-447552758530"
      ~ tags                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all              = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.complete.aws_instance.this will be created
+   resource "aws_instance" "this" {
+       ami                                  = (known after apply)
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = false
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = "ec2-instance-profile-SOPHOS_CNF-38"
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = (known after apply)
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = true
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags                                 = (known after apply)
+       tags_all                             = (known after apply)
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       launch_template {
+           id      = (known after apply)
+           name    = (known after apply)
+           version = "$Latest"
        }

+       maintenance_options {
+           auto_recovery = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_put_response_hop_limit = 1
+           http_tokens                 = "required"
+           instance_metadata_tags      = "enabled"
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_card_index    = (known after apply)
+           network_interface_id  = (known after apply)
        }

+       private_dns_name_options {
+           enable_resource_name_dns_a_record    = (known after apply)
+           enable_resource_name_dns_aaaa_record = (known after apply)
+           hostname_type                        = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }
    }

  # module.complete.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-01fce749fc809cbbd"
      ~ tags     = {
-           "Name"          = "igw-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all = {
-           "Name"          = "igw-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.complete.aws_lambda_function.this will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       filename                       = "7517866eb05f876f45c1f92f4725f6c55a51fdd7"
+       function_name                  = "XG-Initial-Config-SOPHOS_CNF-38"
+       handler                        = "config.main"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = "lambda-role"
+       runtime                        = "python3.7"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "CONSOLE_SECRET_NAME" = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-38-fAHVgY"
+               "IP"                  = "10.0.1.249"
+               "PASSWORD"            = "admin"
+               "REGION_NAME"         = "us-west-1"
+               "USERNAME"            = "admin"
            }
        }

+       ephemeral_storage {
+           size = (known after apply)
        }

+       tracing_config {
+           mode = (known after apply)
        }

+       vpc_config {
+           security_group_ids = [
+               "sg-006eb3c1a4488210c",
            ]
+           subnet_ids         = [
+               "subnet-02ffccee602918e8c",
            ]
+           vpc_id             = (known after apply)
        }
    }

  # module.complete.aws_launch_template.this will be created
+   resource "aws_launch_template" "this" {
+       arn             = (known after apply)
+       default_version = (known after apply)
+       id              = (known after apply)
+       image_id        = "ami-0f37b9b5182756d01"
+       instance_type   = "t3.medium"
+       key_name        = (known after apply)
+       latest_version  = (known after apply)
+       name            = "launch-template-SOPHOS_CNF-38-447552758530"
+       name_prefix     = (known after apply)
+       tags            = (known after apply)
+       tags_all        = (known after apply)
+       user_data       = "eyJzc21rU2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1zZWN1cmUtc3RvcmFnZS1tYXN0ZXIta2V5LVNPUEhPU19DTkYtMzgtNGJiemhOIiwiaG9zdG5hbWUiOiJzb3Bob3MteGctdGVycmFmb3JtIiwic2VuZHN0YXRzIjogIm9uIiwicmVnaW9uIjoidXMtd2VzdC0xIiwic2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1jb25zb2xlLXBhc3N3b3JkLVNPUEhPU19DTkYtMzgtZkFIVmdZIiwiY29uZmlnU2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1iYWNrdXAtY29uZmlndXJhdGlvbi1wYXNzd29yZC1TT1BIT1NfQ05GLTM4LXNiMjFvTSJ9"

+       block_device_mappings {
+           device_name = "/dev/xvda"

+           ebs {
+               delete_on_termination = "true"
+               encrypted             = "false"
+               iops                  = (known after apply)
+               throughput            = (known after apply)
+               volume_size           = 16
+               volume_type           = "gp2"
            }
        }
+       block_device_mappings {
+           device_name = "/dev/xvdg"

+           ebs {
+               delete_on_termination = "true"
+               encrypted             = "false"
+               iops                  = (known after apply)
+               throughput            = (known after apply)
+               volume_size           = 80
+               volume_type           = "gp2"
            }
        }

+       iam_instance_profile {
+           name = "ec2-iam-role-SOPHOS_CNF-38-447552758530"
        }

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = "disabled"
+           http_put_response_hop_limit = 1
+           http_tokens                 = "required"
+           instance_metadata_tags      = "enabled"
        }

+       network_interfaces {
+           device_index         = 1
+           network_interface_id = "eni-0b3bfd622b82cc0de"
        }
+       network_interfaces {
+           device_index         = 0
+           network_interface_id = "eni-0c47b7a826e3ef6fa"
        }
    }

  # module.complete.aws_network_interface.private will be updated in-place
  ~ resource "aws_network_interface" "private" {
        id                        = "eni-0c47b7a826e3ef6fa"
      ~ tags                      = {
-           "Name"          = "priv-eni-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "priv-eni-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)
    }

  # module.complete.aws_network_interface.public will be updated in-place
  ~ resource "aws_network_interface" "public" {
        id                        = "eni-0b3bfd622b82cc0de"
      ~ tags                      = {
-           "Name"          = "pub-eni-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "pub-eni-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)
    }

  # module.complete.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0eaaf4953d83b2361"
      ~ tags             = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0460c61ad511fcde6"
      ~ tags             = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.lan[0] will be updated in-place
  ~ resource "aws_security_group" "lan" {
        id                     = "sg-006eb3c1a4488210c"
        name                   = "Private Subnet"
      ~ tags                   = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.public[0] will be updated in-place
  ~ resource "aws_security_group" "public" {
        id                     = "sg-0037883f0b1840e67"
        name                   = "Public"
      ~ tags                   = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-017eaa2cc025ce155"
      ~ ingress                = [
-           {
-               cidr_blocks      = [
-                   "47.184.79.94/32",
-                   "20.66.50.190/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
+           {
+               cidr_blocks      = [
+                   "47.184.79.94/32",
+                   "20.66.86.139/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
      ~ tags                   = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.complete.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0d296bd1619f56dcd"
      ~ tags                                           = {
-           "Name"          = "public-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                                       = {
-           "Name"          = "public-SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.complete.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0a04cc55c14c0f594"
      ~ tags                             = {
-           "Name"          = "SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                         = {
-           "Name"          = "SOPHOS_CNF-38-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-28-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.key-pair.aws_key_pair.this[0] will be created
+   resource "aws_key_pair" "this" {
+       arn             = (known after apply)
+       fingerprint     = (known after apply)
+       id              = (known after apply)
+       key_name        = (known after apply)
+       key_name_prefix = (known after apply)
+       key_pair_id     = (known after apply)
+       key_type        = (known after apply)
+       public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCwm3wYy77dkjE1ZDIWXq+MCJTMibWiYoYXyVA9gH5/QzUu4ageboyEc+e+ySEdMCTMfJRdasMukKgSzJFIWw0VFXXsc/MVh/LvdaUe7jyCUQImHrUpd5hfaQ6Rb05J4wZO/7Ep6ZU0tFPHM2XrkvmAXy6TQk13mBGOHQaqqmUMvnge4ASXoQ9ne/UufXrL+SOOEBdfeEK9YLcCH9OyN54uW9EqDf/PckbOhSfLNI1JWdAibyD/gm1Cprinete+Tk8yQphl3RLWcW3Y6yOoaRmDYpcOSjxWOtltNd26wnun2us6XUXZxmCYOVaLQNPyhSL+vwkksV1nSvubEI/yKfO348BbrAPg/K2mUKklvmd/fvoz35a9fnkqtiyZsjm2Pr4QH6dq5otVyxK4gvWCs9P+0gNPyqGNIzJClqmyjbmu6tS1GthdZusvpLb5d8d0evhF4PR0Uxy+uyMjb0UEW5A7Oa177m5bjX8qsi96Rp8mjgpXBVyxfkel/xeGkLt+tsg5E1THhgVzIs2RbgIzfxzEeOcd6vJ5plcgsp4O1qlU/e4SS0pzIi1YNgIwYGsBZjaF6tz0mF1CWWWtgQKZgQFBCAp0bN8Y4P4VJLkhz2AVhoewW9BKO+1867VjipNHv3gKxGUJSzXmJwPNKg1CQEGiTxx7N9XCmuOjXRzaLHc2LQ=="
+       tags_all        = (known after apply)
    }

Plan: 5 to add, 13 to change, 0 to destroy.

Changes to Outputs:
+   public_dns = (known after apply)
+   public_ip  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"     
```